package simple;

/**
 * @author mufan
 * @time 2019/8/9
 * 编写一个函数。输入是一个无符号的整数，返回二进制表达式中数组位数为'1'的个数
 * 输入：00000000000000000000000000001011
 * 输出：3
 * 解释：输入的二进制串 00000000000000000000000000001011 中，共有三位为 '1'。
 * <p>
 * 输入：00000000000000000000000010000000
 * 输出：1
 * 解释：输入的二进制串 00000000000000000000000010000000 中，共有一位为 '1'。
 * <p>
 */
public class 二进制中1的个数_191 {

    public int hammingWeight(int n) {
        int count = 1;
        while (n != 0) {
            if (n % 2 == 1) {
                count++;
            }
            n = n >> 1;
        }
        return count;
    }
}
